{
  "products": [
    {
      "id": "a0a1",
      "productName": "Tostão Rosa",
      "category": "flores",
      "price": "75.90",
      "quantity": "2",
      "size": "pequeno",
      "description": "A Tostão Rosa, também conhecida como dinheiro-em-penca, é uma planta encantadora que chama atenção por suas pequenas folhas arredondadas em tons de verde e rosa delicado. Apesar de parecer frágil, ela é bastante resistente quando recebe os cuidados adequados. Para manter suas cores vivas e a folhagem saudável, é importante que receba pelo menos 2 horas diárias de sol.\nSuas folhas crescem de forma pendente, formando uma linda cascata natural que se espalha pelas bordas dos vasos, tornando-a perfeita para vasos suspensos ou como forração. A textura delicada e o contraste das cores dão um toque especial e hipnotizante à decoração.\nMuito procurada por quem deseja um visual alegre e moderno, a Tostão Rosa é uma das plantas mais populares da nossa loja. Confira nossos artigos com dicas de cultivo para manter sua planta sempre bonita e cheia de vida.",
      "image": "/products/Tostao-rosa.png",
      "images": [
        "/products/Tostao-rosa.png"
      ]
    },
    {
      "id": "a670",
      "productName": " Areca Bambu",
      "productId": "1",
      "category": "plantas-grandes",
      "price": "91.90",
      "quantity": "3",
      "size": "pequeno",
      "description": "A palmeira Areca Bambu tem um alto requinte para ambientes internos e externos que dá um toque de elegância e tropicalismo a qualquer sala ou cômodo da casa. Numerosos caules surgem da base para produzir folhas que se parecem um pouco com o bambu. Suas folhas dão boa umidade para a casa e purificam o ar, filtrando os poluentes. Ela é considerada uma das melhores plantas nesse segmento.",
      "image": "/products/Areca-Bambu.png"
    },
    {
      "id": "582c",
      "productName": "Cachepô Freia Branco",
      "productId": "3",
      "category": "vasos",
      "price": "141.90",
      "quantity": "30",
      "size": "pequeno",
      "description": "O Cachepô Freia Branco é um vaso decorativo elegante e versátil, ideal para compor ambientes internos ou externos. Com acabamento liso na cor branca, ele traz um visual clean e moderno, combinando facilmente com diferentes estilos de decoração. Pode ser usado para acomodar vasos de plantas, flores naturais ou artificiais, valorizando o arranjo e deixando o espaço mais sofisticado. Além disso, sua tonalidade neutra destaca ainda mais o verde das folhagens e as cores das flores.\n",
      "image": "/products/Cachepo-com-flores.jpg",
      "images": [
        "/products/Cachepo-vazio.png",
        "/products/Cachepo-com-flores.jpg"
      ]
    },
    {
      "id": "fde1",
      "productName": "Kit de Cultivo Microverdes de Repolho Roxo e Rúcula Isla",
      "productId": "4",
      "category": "sementes",
      "price": "18.90",
      "quantity": "5",
      "size": "pequeno",
      "description": "O Kit de Cultivo de Microverdes de Repolho Roxo e Rúcula Isla é uma opção prática e sustentável para quem deseja cultivar alimentos frescos em casa. Ideal para pequenos espaços, o kit contém tudo o que você precisa para iniciar o plantio: sementes selecionadas, substrato e bandeja de cultivo.\n\nOs microverdes de repolho roxo apresentam folhas delicadas e coloração vibrante, ricas em nutrientes e com sabor levemente adocicado. Já os microverdes de rúcula têm um toque picante característico, perfeito para temperar saladas e pratos.\n\nEm poucos dias, é possível colher vegetais frescos, saudáveis e cheios de sabor, sem necessidade de experiência prévia em jardinagem. \n",
      "image": "/products/kit_de_cultivo.png",
      "images": [
        "/products/kit_de_cultivo.png",
        "/products/products/kit_de_cultivo_microverdes_de_repolho_roxo_e_rucula_isla.png"
      ]
    },
    {
      "id": "2a15",
      "productName": "Feijão Borboleta (Clitoria Ternatea)",
      "productId": "5",
      "category": "flores-comestiveis",
      "price": "15.50",
      "quantity": "60",
      "size": "pequeno",
      "description": "O **Feijão-borboleta** (*Clitoria ternatea*), também conhecido como **ervilha-borboleta** ou **blue pea**, é uma planta trepadeira ornamental e medicinal, originária da Ásia tropical. Suas flores chamam atenção pela coloração azul intensa (podendo variar para branco ou lilás em algumas variedades), lembrando o formato de uma borboleta.\n\nDe crescimento rápido, pode ser cultivada em vasos, cercas ou treliças, preferindo locais ensolarados e solos bem drenados. Além de embelezar jardins, suas flores são comestíveis e muito usadas para fazer chás naturais, que mudam de cor conforme o pH, e também para corantes alimentícios naturais. A planta também é valorizada por suas propriedades antioxidantes e calmantes.\n",
      "image": "/products/FEIJAO-BORBOLETA-CORTE.png",
      "images": [
        "/products/FEIJAO-BORBOLETA-CORTE.png"
      ]
    },
    {
      "id": "04c2",
      "productName": "Buquê de Flores \"A Noite Estrelada\" - Van Gogh",
      "productId": "6",
      "category": "para-presentear",
      "price": "150.00",
      "quantity": "3",
      "size": "medio",
      "description": "O **Buquê de Flores “A Noite Estrelada” – Van Gogh** é uma composição inspirada na famosa obra do pintor holandês, trazendo tons intensos de azul, amarelo e branco. As flores são cuidadosamente selecionadas para representar o movimento e a energia das pinceladas de Van Gogh, criando um arranjo elegante, artístico e cheio de personalidade. Ideal para presentear em ocasiões especiais ou decorar ambientes com um toque de arte e sofisticação.",
      "image": "/products/Buqu_de_Flores_A_noite_estrelada_Van_Gogh_4.png",
      "images": [
        "/products/Buqu_de_Flores_A_noite_estrelada_Van_Gogh_4.png"
      ]
    },
    {
      "id": "75d0",
      "productName": "Buquê com 12 Rosas Vermelhas",
      "productId": "7",
      "category": "para-presentear",
      "price": "80.00",
      "quantity": "10",
      "size": "medio",
      "description": "Buquê apaixonante com rosas vermelhas e delicada gipsofila. Presente perfeito para expressar amor, carinho e sofisticação",
      "image": "/products/400_28625.jpg",
      "images": [
        "/products/400_28625.jpg"
      ]
    },
    {
      "id": "f381",
      "productName": " Cactus Mandacaru Grande",
      "productId": "8",
      "category": "plantas-grandes",
      "price": "450.00",
      "quantity": "20",
      "size": "grande",
      "description": "O Cactus Mandacaru (Cereus jamacaru) é um cacto colunar que pode crescer até 6 metros de altura. Tem espinhos ao longo das costelas e produz flores brancas noturnas e frutos comestíveis. Ideal para jardins secos, tolera pleno sol e pouca água.",
      "image": "/products/CactusMandacaru1_420x.png",
      "images": [
        "/products/CactusMandacaru1_420x.png"
      ]
    },
    {
      "id": "d5b4",
      "productName": "Vaso Para Planta Cachepot Decorativo de Mesa 16x11cm",
      "productId": "9",
      "category": "vasos",
      "price": "16.00",
      "quantity": "10",
      "size": "medio",
      "description": "Dê um toque moderno e elegante à sua decoração com o Vaso Cachepot Decorativo de Mesa 16x11cm – Linha Okla. Com design minimalista e textura listrada diferenciada, ele é perfeito para compor ambientes sofisticados e aconchegantes, seja em mesas, prateleiras, aparadores ou escritórios.\n\nProduzido em polipropileno de alta qualidade, o vaso é leve, resistente e durável, ideal para o dia a dia. Além disso, suas cores modernas permitem combinações versáteis com diferentes estilos de decoração e plantas.",
      "image": "/products/download.jpg",
      "images": [
        "/products/downloaproductsd.jpg"
      ]
    },
    {
      "id": "a342",
      "productName": "Kit Sementes de Alyssum Flor de Mel Amarelo e Violeta Isla",
      "productId": "10",
      "category": "sementes",
      "price": "25.00",
      "quantity": "20",
      "size": "pequeno",
      "description": "Kit de sementes de **Alyssum Flor de Mel** nas cores **amarelo e violeta**, ideal para jardins e vasos. Flores delicadas, perfumadas e atraentes para abelhas e borboletas.",
      "image": "/products/kit_sementes_de_alyssum_flor_de_mel_amarelo_e_violeta_isla_17677_1_d29d66329105bd3fa3cc06882cfb1bc6.png",
      "images": [
        "/products/kit_sementes_de_alyssum_flor_de_mel_amarelo_e_violeta_isla_17677_1_d29d66329105bd3fa3cc06882cfb1bc6.png"
      ]
    },
    {
      "id": "f6f9",
      "productName": "Rabo de Galo – Celósia (Celosia argentea)",
      "productId": "11",
      "category": "flores-comestiveis",
      "price": "12.00",
      "quantity": "20",
      "size": "pequeno",
      "description": "Herbácea anual, ereta, de 30-60 cm de altura, de caule suculento. As folhas, às vezes, são levemente avermelhadas. Inflorescências plumosas, alongadas, eretas vermelhas, amarelas ou branco-creme, com flores bem pequenas. Deve ser cultivada a pleno sol, principalmente em canteiros no meio de gramados, em solo rico em matéria orgânica, de boa drenagem e irrigados frequentemente. Não tolera temperaturas baixas de inverno. É considerada uma Planta Alimentícia não Convencional (PANC) devido suas folhas e flores jovens e sementes.",
      "image": "/products/CELOSIA-CORTECORTE.png",
      "images": [
        "/products/CELOSIA-CORTECORTE.png"
      ]
    },
    {
      "id": "4529",
      "productName": "Arranjo de Flores Lily Bloom",
      "productId": "12",
      "category": "flores",
      "price": "168.00",
      "quantity": "20",
      "size": "pequeno",
      "description": "Arranjo vibrante com flores amarelas, roxas e brancas em vaso bege, perfeito para alegrar ambientes e transmitir boas energias.",
      "image": "/products/230_31258.jpg",
      "images": [
        "/products/230_31258.jpg"
      ]
    },
    {
      "id": "9836",
      "productName": "Cereja Europeia",
      "productId": "9",
      "category": "frutiferas",
      "price": "86.00",
      "quantity": "30",
      "size": "medio",
      "description": "A cereja europeia, conhecida cientificamente como Prunus avium, é uma árvore frutífera que pertence à família Rosaceae. Originária da Europa, essa planta apresenta um porte médio a grande, podendo atingir alturas entre 6 e 15 metros. A cerejeira europeia possui um tronco reto e copa arredondada, com folhas ovais, de cor verde brilhante. Durante a primavera, a árvore se enche de flores brancas ou rosadas, em forma de sino, que exalam um aroma agradável. Essas flores são seguidas pela formação dos frutos, as cerejas, que são conhecidas por seu sabor doce e suculento.",
      "image": "/products/cereja-europeia.png",
      "images": [
        "/products/cereja-europeia.png"
      ]
    },
    {
      "id": "9692",
      "productName": "Goiaba Tailandesa",
      "productId": "10",
      "category": "frutiferas",
      "price": "47.99",
      "quantity": "30",
      "size": "medio",
      "description": "A Goiaba Tailandesa é uma variedade exótica de goiabeira originária da Tailândia, conhecida por seus frutos de tamanho médio a grande, casca verde-amarelada e polpa macia e suculenta. Essa planta tropical é apreciada pelo seu sabor doce e aroma intensamente agradável, sendo utilizada tanto para consumo in natura quanto para a produção de sucos, geleias e doces.",
      "image": "/products/goiaba-tailandesa.png",
      "images": [
        "/products/goiaba-tailandesa.png"
      ]
    }
  ],
  "users": [
    {
      "id": "7743",
      "fullName": "teste",
      "birthDate": "2002-01-01",
      "cpf": "55771307866",
      "phone": "1122223333",
      "mobile": "11999998888",
      "email": "teste@anemo.com",
      "password": "senha123",
      "addresses": [
        {
          "id": "addr1",
          "street": "Av. Eng. Eusébio Stevaux",
          "number": "823",
          "neighborhood": "Santo Amaro",
          "city": "São Paulo",
          "state": "SP",
          "zipCode": "04696-000"
        }
      ],
      "type": "user"
    }
  ],
  "admins": [
    {
      "id": "4f9e",
      "fullName": "Adm Principal",
      "birthDate": "2001-01-01",
      "cnpj": "00000000/001-00",
      "phone": "1122223333",
      "mobile": "11999998888",
      "email": "admin@anemo.com",
      "password": "senhaforte123",
      "type": "admin",
      "addresses": [
        {
          "id": "addr1760364236418",
          "street": "asdas",
          "number": "123",
          "neighborhood": "123",
          "city": "A",
          "state": "D",
          "zipCode": "213"
        }
      ]
    }
  ],
  "categories": [
    {
      "id": "plantas-grandes",
      "name": "Plantas Grandes",
      "icon": "/assets/plantasGrandes.png"
    },
    {
      "id": "para-presentear",
      "name": "Para Presentear",
      "icon": "/assets/presentear.png"
    },
    {
      "id": "vasos",
      "name": "Vasos",
      "icon": "/assets/vasos.png"
    },
    {
      "id": "sementes",
      "name": "Kit de Sementes",
      "icon": "/assets/sementes.png"
    },
    {
      "id": "flores-comestiveis",
      "name": "Flores Comestíveis",
      "icon": "/assets/comestiveis.png"
    },
    {
      "id": "flores",
      "name": "Flores",
      "icon": "/assets/flores.png"
    },
    {
      "id": "frutiferas",
      "name": "Frutíferas",
      "icon": "/assets/frutifera.png"
    }
  ]
}